**** ob-translate

     #+begin_src elisp :tangle packages.el
       (package! ob-translate)
     #+end_src

     #+begin_src elisp
       (setq ob-translate:default-dest "ko")
     #+end_src

     #+RESULTS:
     : ko

     #+begin_src translate :src en :dest ko :tangle no
       Doom is a configuration framework for GNU Emacs tailored for Emacs bankruptcy veterans who want less framework in their frameworks, a modicum of stability (and reproducibility) from their package manager, and the performance of a hand rolled config (or better). It can be a foundation for your own config or a resource for Emacs enthusiasts to learn more about our favorite operating system.
     #+end_src

     #+RESULTS:
     : Doom은 프레임워크의 프레임워크가 적고 패키지 관리자의 약간의 안정성(및 재현성)과 수동 구성(또는 그 이상)의 성능을 원하는 Emacs 파산 베테랑을 위해 맞춤화된 GNU Emacs용 구성 프레임워크입니다. Emacs 애호가가 선호하는 운영 체제에 대해 자세히 알아볼 수 있는 자체 구성 또는 리소스의 기초가 될 수 있습니다.

     [[https://github.com/krisajenkins/ob-translate][krisajenkins/ob-translate - github.com]]

     #+begin_example
       google-translate--search-tkk: Search failed: ",tkk:'"
     #+end_example

     이런 에러 메시지가 뜬다.

     #+begin_src elisp
       (defun google-translate--search-tkk ()
         "Search TKK."
         (list 430675 2721866130))
     #+end_src

     [[https://github.com/atykhonov/google-translate/issues/137][atykhonov/google-translate/issues/137 - github.com]] 글을 참고해서 =google-translate--search-tkk= 함수를 재정의함

**** ob-http

     #+begin_src elisp :tangle packages.el
       (package! ob-http)
     #+end_src

     #+begin_src elisp
       (org-babel-do-load-languages 'org-babel-load-languages
                                    (append org-babel-load-languages
                                            '((http . t)))
                                    )
     #+end_src

     [[https://github.com/zweifisch/ob-http][zweifisch/ob-http - github.com]]

     src 블럭으로 http 응답을 사용할 수 있다.

     #+begin_src http :pretty :tangle no
       GET https://api.github.com/repos/ohyecloudy/dotfiles/languages
     #+end_src

     #+RESULTS:
     #+begin_example
     {
       "Emacs Lisp": 126668,
       "Shell": 90476,
       "YASnippet": 9424,
       "Batchfile": 3991,
       "Vim script": 2181,
       "Python": 945,
       "JavaScript": 719,
       "AutoHotkey": 405
     }
     #+end_example

